Tekla Open API Reference for Tekla Structures 2025
AnalysisDesignParameter Properties
The AnalysisDesignParameter type exposes the following members.
Properties
Name | Description
AnalysisModelName
 Gets or sets the analysis model name.
 (Inherited from AnalysisObject.)
AnalysisObjectType
 Gets or sets the type of the analysis object.
 (Inherited from AnalysisObject.)
FatherObject2ID
 Gets or sets the identifier of the father part.
 (Inherited from AnalysisObject.)
FatherObject2Type
 Gets or sets the type of the father object.
 (Inherited from AnalysisObject.)
FatherObjectID
 Gets or sets the identifier of the father part.
 (Inherited from AnalysisObject.)
FatherObjectType
 Gets or sets the type of the father object.
 (Inherited from AnalysisObject.)
ID
 Gets or sets the identifier of the analysis object.
 (Inherited from AnalysisObject.)
IsGeneral
 Gets or sets a value indicating whether the design parameter is general.
 (Inherited from AnalysisDesignParameterBase.)
Name
 Gets or sets the name of the analysis design parameter.
 (Inherited from AnalysisDesignParameterBase.)
Unit
 Gets or sets the unit of the analysis design parameter.
 (Inherited from AnalysisDesignParameterBase.)
Value
 Gets or sets the value of the analysis design parameter.
Top
See Also
Reference
AnalysisDesignParameter Class
Tekla.Structures.Analysis Namespace